# 6. * Реализовать структуру данных «Товары». Она должна представлять собой список кортежей.
# Каждый кортеж хранит информацию об отдельном товаре.
# В кортеже должно быть два элемента — номер товара и словарь с параметрами
# (характеристиками товара: название, цена, количество, единица измерения).
# Структуру нужно сформировать программно, т.е. запрашивать все данные у пользователя.

# [(num_product,{name:"", price:1, count: 1, unit: ""})]

print("Для выхода из программы в любом месте введите 'exit'")
# while True:
#     name = input("Введите название товара: ")
#     price = input("Введите ")
